In [1]:
people = {
     "first": ["Corey", "Jane", "John"],
     "last": ["Schafer", "Doe", "Doe"],
     "email": ["CoreyMSchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
 }

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [5]:
df["first"]+ " " + df["last"] #combining columns together to form a new col.

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df["full_name"] = df["first"]+ " " + df["last"] #for adding a new column

In [21]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           cap@avenge.com            NaN  Steve   Rogers

In [8]:
df.drop(columns = ["first", "last"], inplace=True)#for deleting a column.

In [9]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [10]:
df["full_name"].str.split(" ", expand=True) #for splitting a column #expand: for setting what is splitted into a df.

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [11]:
df[["first","last"]] = df["full_name"].str.split(" ", expand=True) #adding columns

In [12]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [13]:
df.append({"first":"Tony"}, ignore_index=True) #For adding a single row of data(it fills Nan for non specified.)
#ignore_index: for ingnoring the error when appending to a df.

C:\Users\ABOVE ALL OMOLERE\AppData\Local\Temp\ipykernel_4180\943255630.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"first":"Tony"}, ignore_index=True) #For adding a row

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [14]:
people = {
     "first": ["Tony", "Steve"],
     "last": ["Stark", "Rogers"],
     "email": ["IronMan@avenge.com", "cap@avenge.com"]
 }
df2 = pd.DataFrame(people)

In [15]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      cap@avenge.com

In [22]:
df.append(df2, ignore_index=True) #adding 2 data_frame together.

TypeError: append() got an unexpected keyword argument 'inplace'

In [17]:
df = df.append(df2, ignore_index=True) #combining dataframes together.

C:\Users\ABOVE ALL OMOLERE\AppData\Local\Temp\ipykernel_4180\445450659.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True)

In [18]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           cap@avenge.com            NaN  Steve   Rogers

In [19]:
df.drop(index=4) #removing rows

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [20]:
filt = df["last"] == "Doe" #dropping values based on filters
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           cap@avenge.com            NaN  Steve   Rogers